//Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5
let result = "";

for (let i = 20; i <= 30; i += 0.5) {
    result += i + " ";
}
console.log(result);

//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
let oneDollars  = 27;

for (let i = 10; i <= 100; i += 10) {

    console.log(i + " доларів = " + (i * oneDollars) + " гривень");
}

//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
function square(N) {
    for (let i = 1; i <= 100; i++) {
        if (i * i <= N) {
            console.log(i)
        }
    }
}

square(17)

//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

function simple(X) {
    if (X === 1) {
        console.log('Не просте число');
        return;
    }

    for (let i = 2; i < X; i++) {
        if (X % i === 0) {
            console.log('Не просте число');
            return;
        }
    }
    console.log('Просте число');
}

simple(17);

//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна)
function number(y) {
    for (let i = 1; i < y; i++) {
        if (Math.pow(3, i) === y) {
            console.log('Можемо отримати данне число');
            return;
        }
    }
    console.log('Не можемо отримати данне число');
}

number(27);